Revit 2024 API
LinkedResourceOpenedEventArgs.LinkedResourcePathName Property
 Path of the linked resource.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public string LinkedResourcePathName { get; }
Visual Basic
Public ReadOnly Property LinkedResourcePathName As String
	Get
Visual C++
public:
property String^ LinkedResourcePathName {
	String^ get ();
}
See Also
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace